run/cokeCombustion/combustion_in_fracture_martrix/matrix_from_micro_ct/width=50/T773_Pe1e-1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "coke.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        // solver          PCG;
        // preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
        maxIter          100;
        // relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-6;
        relTol          0;
        // maxIter         100;
    }


    "(h|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        //solver          GAMG;
        //smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        //maxIter         100;
    }

    "(h|e)Final"
    {
        $h;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|Yi)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        //solver          GAMG;
        //smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        // maxIter         100;
        // relTol          0;
    }

    "(U|Yi)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

}


PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors       1;
    nOuterCorrectors  15;

    outerCorrectorResidualControl
    {
        "(h|e)"    
        {
            tolerance  1e-6;
            relTol     0;
        }

        // "(Y.*|O2|CO2)"    
        // {
        //     tolerance  1e-6;
        //     relTol     0;
        // }
        
    }

}


// ************************************************************************* //
